Repository: aysegultoptas/aspnet
Catalog: *-WebSite/Odev3/Kaynaklar/dili.resx
Languages: my

# a1
source: There are four categories in the competition:
my: Yarışmada dört kategori bulunmaktadır:

# a10
source: We are sending the TÜRKSAT 5B satellite into space on 19 December at 06:58 with the SpaceX Falcon 9 rocket.
my: TÜRKSAT 5B uydusunu 19 Aralık sabah 06.58'de SpaceX Falcon 9 roketiyle uzaya gönderiyoruz.

# a11
source: Astronauts in Space!
my: Astronotlar Uzayda!

# a12
source: Teknofest Winners!
my: Teknofest Kazananları!

# a13
source: We Are Sending 5D Satellite to Space!
my: 5B Uydusunu Uzaya Gönderiyoruz!

# a14
source: Follow us!
my: Bizi Takip Edin!

# a15
source: Follow us on Instagram!
my: İnstagram'da bizi takip edin!

# a16
source: Follow us on Twitter!
my: Twitter'da bizi takip edin!

# a17
source: Follow us on LinkedIn!
my: Linkedin'de bizi takip edin!

# a18
source: Follow us on GitHub!
my: GitHub'da bizi takip edin!

# a19
source: ROCKET
my: ROKET

# a2
source: High School Category (5,000 feet)
my: Lise Kategorisi (5.000 feet)

# a3
source: Medium Altitude Category (10,000 feet)
my: Orta İrtifa Kategorisi (10.000 feet)

# a4
source: High Altitude Category (20,000 feet)
my: Yüksek İrtifa Kategorisi (20.000 feet)

# a5
source: Challenge Category (10,000 feet)
my: Zorlu Görev Kategorisi (10.000 feet)

# a6
source: Within the scope of the competition, the teams; They are required to prepare 3 different reports: Preliminary Design Report (ÖTR), Critical Design Report (KTR), Shooting Readiness Report (AHR).
my: Yarışma kapsamında takımların; Ön Tasarım Raporu (ÖTR), Kritik Tasarım Raporu (KTR), Atış Hazırlık Raporu (AHR) olmak üzere 3 farklı rapor hazırlamaları gerekmektedir.

# a7
source: Rocket News
my: Roket Haberleri

# a8
source: SpaceX has delivered NASA's "Crew-3" astronauts to the International Space Station!
my: SpaceX, NASA'nın "Crew-3" astronotlarını Uluslararası Uzay İstasyonuna ulaştırdı!

# a9
source: The winners of Roketsan's Rocket Competition within the scope of TEKNOFEST have been announced!
my: Roketsan'ın TEKNOFEST kapsamındaki Roket Yarışması'nın kazananları belli oldu!

# adminPaneli
source: Admin Panel
my: Yönetici Paneli

# Anasayfa
source: Home
my: Anasayfa

# anasayfayazi
source: Rocket, mechanically, as in a jet engine, produces thrust depending on the combustion process, but while doing this, it requires a forced air from the environment. It is the name given to the motor that does not need an input. All military or civilian bullets, missiles, space-air vehicles that produce self-propelled by using a rocket engine can also be called rocket. Rocket Competition is organized within the scope of TEKNOFEST Technology competitions. The aim of the Rocket Competition is to increase students' interest in the field of space technologies and to improve their abilities in this field. Many technology competitions are organized within the scope of TEKNOFEST Aviation, Space and Technology Festival in order to raise awareness in the society about aviation, space and technology, to support young people who are interested in these fields, to encourage young people to research on the technologies of the future, and to make them familiar with professional design processes.
my: Roket, mekanik anlamda bir jet motorunda olduğu gibi yanma işlemine bağlı olarak itki üreten ancak bunu yaparken çevreden mecburi bir hava girişine ihtiyaç duymayan motora verilen addır. Bir roket motoru kullanarak öz-itki üreten askerî ya da sivil amaçlı mermi, füze, uzay-hava araçlarının tamamına da roket denilebilir.TEKNOFEST Teknoloji yarışmaları kapsamında Roket Yarışması düzenlenmektedir. Roket Yarışmanın amacı öğrencilerin uzay teknolojileri alanına ilgilerini arttırarak bu alandaki kabiliyetlerini geliştirmektir. Havacılık, uzay ve teknoloji konularında toplumda farkındalık oluşturmak, bu alanlara ilgisi olan gençleri desteklemek, gençleri geleceğin teknolojileri üzerinde araştırma yapmaya özendirmek ve profesyonel tasarım süreçlerine aşina olmalarını sağlamak amacıyla TEKNOFEST Havacılık, Uzay ve Teknoloji Festivali kapsamında birçok teknoloji yarışması düzenlenmektedir.

# AviyonikSistem
source: Avionics System
my: Aviyonik Sistem

# BasincSensorleri
source: Pressure Sensors
my: Basınç Sensörleri

# footer
source: All rights of this site belong to Ayşegül Toptaş.
my: Bu sitenin tüm hakları Ayşegül Toptaş'a aittir.

# kaydol
source: Sign up
my: Üye Ol

# KurtarmaSistemi
source: Recovery System
my: Kurtarma Sistemi

# m1
source: MICROPROCESSORS
my: MİKROİŞLEMCİLER

# m10
source: PWM Output
my: PWM Çıkışı

# m11
source: Weight
my: Ağırlık

# m12
source: Arduino is an electronic hardware and software based development platform. Arduino Uno is the most widely used and best known model. It was made available in 2010. With Arduino Uno, you can get physical information from various sensors and do various experiments with this information. You can also get an output from stimuli such as motor, LED, buzzer. The speed of the motors, such as the brightness levels of the LEDs, are controlled by connecting the exciter to these PWM pins. The 6 analog inputs in Arduino Uno are for sensors from which we can receive analog input signals.
my: Arduino, elektronik donanım ve yazılım temelli bir geliştirme platformudur. Arduino Uno, en yaygın kullanılan ve en çok bilinen modelidir. 2010 yılında kullanıma sunulmuştur. Arduino Uno ile çeşitli sensörlerden fiziksel bilgi alabilir, bu bilgiler ile çeşitli deneyler yapabilirsiniz. Ayrıca motor, LED, buzzer gibi uyarıcılardan bir çıktı elde edebilirsiniz. Motorların hızı, LED’lerdeki parlaklık seviyeleri gibi analog olarak kontrol edilmesi istenen uyarıcılar bu PWM pinlerine bağlanarak kontrol edilir. Arduino Uno’daki 6 tane analog giriş ise analog giriş sinyali alabildiğimiz sensörler içindir.

# m13
source: Digital Input/Output Pin
my: Dijital Giriş/Çıkış Pini

# m14
source: Operating voltage
my: Çalışma Gerilimi

# m15
source: Arduino Nano is a small, complete and breadboard friendly Arduino board that houses an ATmega328 microcontroller (Arduino Nano 3.x) or an Atmega168 (Arduino Nano 2.x) microcontroller. The Arduino Nano can be powered by connecting a computer with a type B mini USB cable, or it can be powered from an external power source. An external power supply in the range of 6-20 V can be connected to pin 30 or supplied with a regulated voltage of 5 V from pin 27. All 14 digital input/output pins in Arduino Nano can be used as inputs or outputs with pinMode(), digitalWrite() and digitalRead() functions. These pins work with 5 V.
my: Arduino Nano ATmega328 mikrodenetleyici (Arduino Nano 3.x) veya Atmega168 (Arduino Nano 2.x) mikrodenetleyici barındıran, küçük, tam ve breadboard dostu bir Arduino kartıdır. Arduino Nano bir B tipi mini USB kablosu ile bilgisayar bağlanarak çalıştırılabilir ya da harici bir güç kaynağından beslenebilir. 6-20 V aralığında bir harici güç kaynağı pin 30'a bağlanabilir ya da 5 V regüle edilmiş bir gerilim ile pin 27 den beslenebilir. Arduino Nano 'da bulunan 14 tane dijital giriş/çıkış pininin tamamı, pinMode(), digitalWrite() ve digitalRead() fonksiyonları ile giriş ya da çıkış olarak kullanılabilir. Bu pinler 5 V ile çalışır.

# m16
source: Number of LEDs
my: LED Sayısı

# m17
source: Push Button
my: Push Buton

# m18
source: Power source
my: Güç Kaynağı

# m19
source: The STM32F407 is a 32-bit microcontroller with a clock frequency of 168 MHz. Especially in DSP applications, it is used as the main brain of structures with many sub-systems. It has STM32F4VG kernel on it. It has 3-axis accelerometer, internal audio input and digital analog converter connected to it, 4 programmable LEDs, 2 buttons.
my: STM32F407 kısaca 168 Mhz saat frekansına sahip 32-bit’lik bir mikrodenetleyicidir. Özellikle DSP uygulamalarında , içerisinde bir çok alt sistemler olan yapıların ana beyni olarak kullanılmaktadır. Üzerinde STM32F4VG çekirdeğini barındırmaktadır. 3-eksen ivme ölçer , dahili ses girişi ve buna bağlı dijital analog dönüştürücü , 4 adet programlanabilir LED , 2 adet buton barındırır.

# m2
source: What is a microprocessor?
my: Mikroişlemci nedir?

# m20
source: Teensy 3.6 is a small and breadboard compatible development board. It has 32-bit ARM Cortex-M4 platform. It offers easy programming with a modified version of the Arduino IDE (Teensyduino). Teensy 3.6 is the latest version of Teensy that has been updated to versions 3.2 and 3.5 and offers more processing power. Version 3.6 has a 32-bit 180MHz ARM Cortex-M4 processor with a floating point unit. All digital and analog inputs work at 3.3V
my: Teensy 3.6, küçük boylu ve breadboard uyumlu bir geliştirme kartıdır. 32-bit ARM Cortex-M4 platformuna sahiptir. Arduino IDE'nin modifiye edilmiş bir versiyonu (Teensyduino) ile kolay bir şekilde programlama imkanı sunar. Teensy 3.6, 3.2 ve 3.5 sürümlerinin güncellenmiş ve daha fazla işlem gücü sunan en son Teensy sürümüdür. 3.6 sürümü, kayan nokta ünitesi (floating point unit) içeren 32-bit 180MHz ARM Cortex-M4 işlemciye sahiptir. Tüm dijital ve analog girişler 3.3V seviyesinde çalışmaktadır

# m3
source: Microprocessor is an integrated circuit element that can perform logical and arithmetic operations and direct its operation depending on the results of these operations. Microprocessors, which are the brains of the electronic structures they are in, control the mechanism they are connected to.
my: Mikroişlemci, mantıksal ve aritmetik işlemler yapabilen ve bu işlemlerin neticesine bağlı olarak çalışmasını yönlendirebilen tümleşik bir devre elemanıdır. Bulundukları elektronik yapıların beyni olan mikroişlemciler, bağlı oldukları mekanizmanın kontrolünü sağlarlar.

# m4
source: What should be considered when choosing a microprocessor?
my: Mikroişlemci seçilirken nelere dikkat edilmelidir?

# m5
source: Microprocessor selections should be made in accordance with the software language to be used. Having sufficient number of input-output pins for the system to be used and sufficient processing power are the points to be considered when choosing.
my: Mikroişlemci seçimleri kullanılacak yazılım diline uygun olacak şekilde yapılmalıdır. Kullanılacak sistem için yeterli sayıda giriş-çıkış pini bulunması ve işlemci gücünün yeterli olması seçim yapılırken dikkat edilmesi gereken noktalardır.

# m6
source: Types of Microprocessors
my: Mikroişlemci Çeşitleri

# m7
source: Feature
my: Özellik

# m8
source: Digital Output Pin
my: Dijital Çıkış Pini

# m9
source: Analog Input
my: Analog Giriş

# MekanikSistem
source: Mechanical System
my: Mekanik Sistem

# merhaba
source: Hello
my: Merhaba

# Mikroislemciler
source: Microprocessors
my: Mikroişlemciler

# oturumac
source: Login
my: Üye Girişi

# oturumkapa
source: Sign Out
my: Oturumu Kapat

# SicaklikSensorleri
source: Temperature Sensors
my: Sıcaklık Sensörleri
